Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/pfw.h
#define PFW_DFT_VALP1RR01_PR1RR0_Pos          _UINT32_(0)                                          /* (PFW_DFT_VALP1RR01)  Position */
#define PFW_DFT_VALP1RR01_PR1RR0_Msk          (_UINT32_(0xFFFF) << PFW_DFT_VALP1RR01_PR1RR0_Pos)   /* (PFW_DFT_VALP1RR01)  Mask */
#define PFW_DFT_VALP1RR01_PR1RR0(value)       (PFW_DFT_VALP1RR01_PR1RR0_Msk & (_UINT32_(value) << PFW_DFT_VALP1RR01_PR1RR0_Pos)) /* Assigment of value for PR1RR0 in the PFW_DFT_VALP1RR01 register */
#define PFW_DFT_VALP1RR01_P1RR1_Pos           _UINT32_(16)                                         /* (PFW_DFT_VALP1RR01)  Position */
#define PFW_DFT_VALP1RR01_P1RR1_Msk           (_UINT32_(0xFFFF) << PFW_DFT_VALP1RR01_P1RR1_Pos)    /* (PFW_DFT_VALP1RR01)  Mask */
#define PFW_DFT_VALP1RR01_P1RR1(value)        (PFW_DFT_VALP1RR01_P1RR1_Msk & (_UINT32_(value) << PFW_DFT_VALP1RR01_P1RR1_Pos)) /* Assigment of value for P1RR1 in the PFW_DFT_VALP1RR01 register */
#define PFW_DFT_VALP1RR01_Msk                 _UINT32_(0xFFFFFFFF)                                 /* (PFW_DFT_VALP1RR01) Register Mask  */


/* -------- PFW_DFT_VALP1RR23 : (PFW Offset: 0x110) (R/W 32)  -------- */
#define PFW_DFT_VALP1RR23_RESETVALUE          _UINT32_(0x00)                                       /*  (PFW_DFT_VALP1RR23)   Reset Value */

#define PFW_DFT_VALP1RR23_PR1RR2_Pos          _UINT32_(0)                                          /* (PFW_DFT_VALP1RR23)  Position */
#define PFW_DFT_VALP1RR23_PR1RR2_Msk          (_UINT32_(0xFFFF) << PFW_DFT_VALP1RR23_PR1RR2_Pos)   /* (PFW_DFT_VALP1RR23)  Mask */
#define PFW_DFT_VALP1RR23_PR1RR2(value)       (PFW_DFT_VALP1RR23_PR1RR2_Msk & (_UINT32_(value) << PFW_DFT_VALP1RR23_PR1RR2_Pos)) /* Assigment of value for PR1RR2 in the PFW_DFT_VALP1RR23 register */
#define PFW_DFT_VALP1RR23_P1RR3_Pos           _UINT32_(16)                                         /* (PFW_DFT_VALP1RR23)  Position */
#define PFW_DFT_VALP1RR23_P1RR3_Msk           (_UINT32_(0xFFFF) << PFW_DFT_VALP1RR23_P1RR3_Pos)    /* (PFW_DFT_VALP1RR23)  Mask */
#define PFW_DFT_VALP1RR23_P1RR3(value)        (PFW_DFT_VALP1RR23_P1RR3_Msk & (_UINT32_(value) << PFW_DFT_VALP1RR23_P1RR3_Pos)) /* Assigment of value for P1RR3 in the PFW_DFT_VALP1RR23 register */
#define PFW_DFT_VALP1RR23_Msk                 _UINT32_(0xFFFFFFFF)                                 /* (PFW_DFT_VALP1RR23) Register Mask  */


/* -------- PFW_DFT_VALP1RR45 : (PFW Offset: 0x120) (R/W 32)  -------- */
#define PFW_DFT_VALP1RR45_RESETVALUE          _UINT32_(0x00)                                       /*  (PFW_DFT_VALP1RR45)   Reset Value */

#define PFW_DFT_VALP1RR45_PR1RR4_Pos          _UINT32_(0)                                          /* (PFW_DFT_VALP1RR45)  Position */
#define PFW_DFT_VALP1RR45_PR1RR4_Msk          (_UINT32_(0xFFFF) << PFW_DFT_VALP1RR45_PR1RR4_Pos)   /* (PFW_DFT_VALP1RR45)  Mask */
#define PFW_DFT_VALP1RR45_PR1RR4(value)       (PFW_DFT_VALP1RR45_PR1RR4_Msk & (_UINT32_(value) << PFW_DFT_VALP1RR45_PR1RR4_Pos)) /* Assigment of value for PR1RR4 in the PFW_DFT_VALP1RR45 register */
#define PFW_DFT_VALP1RR45_P1RR5_Pos           _UINT32_(16)                                         /* (PFW_DFT_VALP1RR45)  Position */
#define PFW_DFT_VALP1RR45_P1RR5_Msk           (_UINT32_(0xFFFF) << PFW_DFT_VALP1RR45_P1RR5_Pos)    /* (PFW_DFT_VALP1RR45)  Mask */
#define PFW_DFT_VALP1RR45_P1RR5(value)        (PFW_DFT_VALP1RR45_P1RR5_Msk & (_UINT32_(value) << PFW_DFT_VALP1RR45_P1RR5_Pos)) /* Assigment of value for P1RR5 in the PFW_DFT_VALP1RR45 register */
#define PFW_DFT_VALP1RR45_Msk                 _UINT32_(0xFFFFFFFF)                                 /* (PFW_DFT_VALP1RR45) Register Mask  */


/* -------- PFW_DFT_VALP1RR67 : (PFW Offset: 0x130) (R/W 32)  -------- */
#define PFW_DFT_VALP1RR67_RESETVALUE          _UINT32_(0x00)                                       /*  (PFW_DFT_VALP1RR67)   Reset Value */

#define PFW_DFT_VALP1RR67_PR1RR6_Pos          _UINT32_(0)                                          /* (PFW_DFT_VALP1RR67)  Position */
#define PFW_DFT_VALP1RR67_PR1RR6_Msk          (_UINT32_(0xFFFF) << PFW_DFT_VALP1RR67_PR1RR6_Pos)   /* (PFW_DFT_VALP1RR67)  Mask */
#define PFW_DFT_VALP1RR67_PR1RR6(value)       (PFW_DFT_VALP1RR67_PR1RR6_Msk & (_UINT32_(value) << PFW_DFT_VALP1RR67_PR1RR6_Pos)) /* Assigment of value for PR1RR6 in the PFW_DFT_VALP1RR67 register */
#define PFW_DFT_VALP1RR67_P1RR7_Pos           _UINT32_(16)                                         /* (PFW_DFT_VALP1RR67)  Position */
#define PFW_DFT_VALP1RR67_P1RR7_Msk           (_UINT32_(0xFFFF) << PFW_DFT_VALP1RR67_P1RR7_Pos)    /* (PFW_DFT_VALP1RR67)  Mask */
#define PFW_DFT_VALP1RR67_P1RR7(value)        (PFW_DFT_VALP1RR67_P1RR7_Msk & (_UINT32_(value) << PFW_DFT_VALP1RR67_P1RR7_Pos)) /* Assigment of value for P1RR7 in the PFW_DFT_VALP1RR67 register */
#define PFW_DFT_VALP1RR67_Msk                 _UINT32_(0xFFFFFFFF)                                 /* (PFW_DFT_VALP1RR67) Register Mask  */


/* -------- PFW_DFT_VALP2RR01 : (PFW Offset: 0x140) (R/W 32)  -------- */
#define PFW_DFT_VALP2RR01_RESETVALUE          _UINT32_(0x00)                                       /*  (PFW_DFT_VALP2RR01)   Reset Value */

#define PFW_DFT_VALP2RR01_PR2RR0_Pos          _UINT32_(0)                                          /* (PFW_DFT_VALP2RR01)  Position */
#define PFW_DFT_VALP2RR01_PR2RR0_Msk          (_UINT32_(0xFFFF) << PFW_DFT_VALP2RR01_PR2RR0_Pos)   /* (PFW_DFT_VALP2RR01)  Mask */
#define PFW_DFT_VALP2RR01_PR2RR0(value)       (PFW_DFT_VALP2RR01_PR2RR0_Msk & (_UINT32_(value) << PFW_DFT_VALP2RR01_PR2RR0_Pos)) /* Assigment of value for PR2RR0 in the PFW_DFT_VALP2RR01 register */
#define PFW_DFT_VALP2RR01_P2RR1_Pos           _UINT32_(16)                                         /* (PFW_DFT_VALP2RR01)  Position */
#define PFW_DFT_VALP2RR01_P2RR1_Msk           (_UINT32_(0xFFFF) << PFW_DFT_VALP2RR01_P2RR1_Pos)    /* (PFW_DFT_VALP2RR01)  Mask */
#define PFW_DFT_VALP2RR01_P2RR1(value)        (PFW_DFT_VALP2RR01_P2RR1_Msk & (_UINT32_(value) << PFW_DFT_VALP2RR01_P2RR1_Pos)) /* Assigment of value for P2RR1 in the PFW_DFT_VALP2RR01 register */
#define PFW_DFT_VALP2RR01_Msk                 _UINT32_(0xFFFFFFFF)                                 /* (PFW_DFT_VALP2RR01) Register Mask  */


